/***********************************************************\
 * © 1993 Adobe Systems Incorporated. All rights reserved. *
 *                                                         *
 *   Core Flash Player localizable strings                 *
\***********************************************************/

/////////////////////////////////////////////////////////////
// BLOCK 1: User Interface strings                         //
/////////////////////////////////////////////////////////////

// Shared strings
"GenericDialog_Header"						= "Adobe Flash Player %@";

// Local security dialog
"LocalSecurity_Title"						= "Zabezpieczenia programu Adobe Flash Player";
"LocalSecurity_Line1"						= "Program Adobe® Flash® Player przerwał potencjalnie niebezpieczną operację. Następująca aplikacja lokalna na komputerze lub w sieci:";
"LocalSecurity_Line2"						= "próbuje skontaktować się z tym położeniem, używając połączenia z Internetem:";
"LocalSecurity_Line3"						= "Aby umożliwić tej aplikacji łączenie się z Internetem, kliknij przycisk Ustawienia.\nPo wprowadzeniu zmian w ustawieniach należy ponownie uruchomić tę aplikację.";

"LocalSecurity_SettingsBtn"					= "Ustawienia…";
"LocalSecurity_OKBtn"						= "OK";

// Flash Exception dialog
"ActionScriptErrorLabel"					= "Wystąpił błąd języka ActionScript:";
"ExceptionDialog_DismissAllButton"			= "Odrzuć wszystko";
"ExceptionDialog_ContinueButton"			= "Kontynuuj";

// Script taking too long dialog
"StuckScript_Message"						= "Skrypt z tego filmu powoduje, że program Adobe® Flash® Player 10 działa wolno. Jeśli ten skrypt będzie nadal działać, komputer może przestać odpowiadać.\n\nCzy chcesz przerwać działanie skryptu?";
"StuckScript_YesBtn"						= "Tak";
"StuckScript_NoBtn"							= "Nie";

// Debug or profile connection failed dialog
"DebugFailed_Header"						= "Adobe® Flash® Player";
"DebugFailed_Message"						= "Program Adobe Flash Player 10 nie może nawiązać połączenia z debugerem lub programem profilującym.";

// Debugger connection dialog
"ShowDialogAtLaunchText"					= "Pokazuj to okno przy uruchamianiu";
"ConnectToDebuggerText"						= "Połącz z debugerem";
"DebuggerLocationText"						= "Debuger lub aplikacja obsługująca:";
"LocationLocalText"							= "Na tym komputerze (host lokalny)";
"LocationRemoteText"						= "Pod adresem IP:";
"ContinueButtonTitle"						= "Kontynuuj";

// Can't find preference pane alert
"CantFindPrefPane_Title"					= "Unable to Load Flash Player Preferences Pane";
"CantFindPrefPane_Message"					= "To access your global settings, re-install Adobe Flash Player. It can be downloaded from http://www.adobe.com/go/getflashplayer";

// ----------------------------------------------------------
"IDS_FILE_CHOOSER_TITLE"					= "Wybierz pliki";
"IDS_DIR_CHOOSER_TITLE"						= "Wybierz folder";
"IDS_CHOOSER_SELECT_BUTTON"					= "Wybierz";

// ----------------------------------------------------------
"IDS_FILE_UPLOAD_CHOOSER"					= "Wybierz plik do wysłania przez ";
"IDS_FILE_UPLOAD_CHOOSER_MULTI_SELECT"		= "Wybierz pliki do wysłania przez ";
"IDS_FILE_DOWNLOAD_SAVE"					= "Wybierz położenie pobierania przez ";
"IDS_DOWNLOAD_FILE_SAVE_CLASSIC_PLUGIN"		= "Wybierz położenie pobierania";

// ----------------------------------------------------------

/////////////////////////////////////////////////////////////
// BLOCK 2: Error strings                                  //
/////////////////////////////////////////////////////////////

"IDS_CONSOLE_CASE"							= "— Prawdopodobna niezgodność wielkości liter.";
"IDS_CONSOLE_SANDBOX"						= "*** Naruszenie obszaru izolowanego ***";
"IDS_CONSOLE_NOT_PERMITTED"					= "Połączenie z %s zostało zablokowane — brak zezwolenia od %s";
"IDS_CONSOLE_TITLE"							= "Konsola debugowania programu Flash Player";
"IDS_CONSOLE_FSCOMMAND_HALTED"				= "Polecenie FSCommand zostało zablokowane (właściwość AllowScriptAccess ma wartość „%s”): %s";
"IDS_CONSOLE_URL_HALTED"					= "Skrypt URL został zablokowany (właściwość AllowScriptAccess ma wartość „%s”): %s";
"IDS_CONSOLE_SECURITY_CONTEXT"				= "Obiekt klasy SecurityDomain „%s” próbował uzyskać dostęp do niezgodnego kontekstu „%s”.";
"IDS_CONSOLE_SECURITY_NULL"					= "Obiekt klasy SecurityDomain „%s” próbował uzyskać dostęp do kontekstu o wartości NULL.";
"IDS_CONSOLE_SECURITY_PLAYER"				= "Obiekt klasy SecurityDomain „%s” próbował uzyskać dostęp do kontekstu UI programu Flash Player.";
"IDS_CONSOLE_WARN_NO_PROP"					= "Uwaga! Obiekt „%s” nie ma właściwości „%s”.";
"IDS_CONSOLE_WARN_NOT_A_FUNC"				= "Uwaga! Wyrażenie %s nie jest funkcją";
"IDS_CONSOLE_WARN_NOT_DEFINED"				= "Uwaga! Obiekt %s nie został zdefiniowany";
"IDS_CONSOLE_WARN_400"						= "Uwaga! 400 — nieprawidłowe żądanie: %s";
"IDS_CONSOLE_WARN_401"						= "Uwaga! 401 — nieautoryzowane: %s";
"IDS_CONSOLE_WARN_402"						= "Uwaga! 402 — wymagana płatność: %s";
"IDS_CONSOLE_WARN_403"						= "Uwaga! 403 — zabronione: %s";
"IDS_CONSOLE_WARN_404"						= "Uwaga! 404 — nie znaleziono: %s";
"IDS_CONSOLE_WARN_405"						= "Uwaga! 405 — metoda niedozwolona, nieprawidłowy typ MIME: %s";
"IDS_CONSOLE_WARN_406"						= "Uwaga! 406 — niedopuszczalne: %s";
"IDS_CONSOLE_WARN_500"						= "Uwaga! 500 — błąd serwera: %s";
"IDS_CONSOLE_WARN_501"						= "Uwaga! 501 — niezaimplementowane: %s";
"IDS_CONSOLE_WARN_502"						= "Uwaga! 502 — nieprawidłowa brama: %s";
"IDS_CONSOLE_WARN_503"						= "Uwaga! 503 — brak zasobów: %s";
"IDS_CONSOLE_WARN_504"						= "Uwaga! 504 — limit czasu bramy: %s";
"IDS_CONSOLE_WARN_505"						= "Uwaga! 505 — nieobsługiwana wersja protokołu HTTP: %s";
"IDS_CONSOLE_WARN_NO_CONNECT"				= "Uwaga! Nie można nawiązać połączenia, %s";
"IDS_CONSOLE_WARN_FAIL_ALLOCATE_URL"		= "Uwaga! Przydzielanie ścieżki adresu URL nie powiodło się.";
"IDS_CONSOLE_WARN_CORRUPT_DATA"				= "Uwaga! Analizowanie uszkodzonych danych nie powiodło się.";
"IDS_CONSOLE_WARN_FAIL_PLACE"				= "Uwaga! Umieszczanie obiektu na głębokości %d nie powiodło się.";
"IDS_CONSOLE_WARN_FAIL_PLACE_MISSING_CHAR" 	= "Uwaga! Umieszczanie obiektu nie powiodło się: brakujący znak.";
"IDS_CONSOLE_WARN_FTP_FILE"					= "Uwaga! Błąd protokołu FTP podczas otwierania pliku, %s";
"IDS_CONSOLE_WARN_HTTP_REQUEST"				= "Uwaga! Błąd protokołu HTTP dotyczący żądania otwarcia, %s";
"IDS_CONSOLE_WARN_HTTP_QUERY"				= "Uwaga! Błąd protokołu HTTP dotyczący informacji o zapytaniu, %s";
"IDS_CONSOLE_WARN_HTTP_SEND"				= "Uwaga! Błąd protokołu HTTP dotyczący żądania wysłania, %d: %s";
"IDS_CONSOLE_WARN_NET_CONNECT"				= "Uwaga! Błąd połączenia z Internetem, %s";
"IDS_CONSOLE_WARN_NET_OPEN"					= "Uwaga! Błąd otwierania zasobów internetowych";
"IDS_CONSOLE_WARN_UNKNOWN_DOWNLOAD_TYPE"	= "Uwaga! Nieznany typ pliku do pobrania dla odtwarzacza, %s";
"IDS_CONSOLE_WARN_BAD_PORT"					= "Uwaga! Port %d wykracza poza dozwolony zakres.";
"IDS_CONSOLE_WARN_WARNING_LIMIT"			= "Uwaga! Osiągnięto limit ostrzeżeń wynoszący %d";
"IDS_CONSOLE_WARN_UNDECLARED_PROP"			= "Uwaga! Odniesienie do niezadeklarowanej właściwości, „%s”";
"IDS_CONSOLE_WARN_UNDECLARED_VAR"			= "Uwaga! Odniesienie do niezadeklarowanej zmiennej, „%s”";
"IDS_CONSOLE_WARN_SOCKET_ERROR"				= "Uwaga! Błąd soketu, %s";
"IDS_CONSOLE_WARN_STACK"					= "Uwaga! Przepełnienie stosu";
"IDS_CONSOLE_WARN_HOST"						= "Uwaga! Nie można określić hosta: %s";
"IDS_CONSOLE_WARN_GENERIC_HOST"				= "Uwaga! Nie można określić hosta";
"IDS_CONSOLE_WARN_EXCEPTION"				= "Uwaga! Nieobsłużony wyjątek, %s";
"IDS_CONSOLE_WARN_HTTP_STATUS"				= "Uwaga! Nierozpoznany stan protokołu HTTP %d: %s";
"IDS_CONSOLE_WARN_NO_URL"					= "Uwaga! Brak ścieżki adresu URL";
"IDS_CONSOLE_SECURITY_DIALOG"				= "Napotkano dopasowanie starszej domeny — %s próbuje uzyskać dostęp do %s.";
"IDS_CONSOLE_LOCAL_OUTBOUND"				= "— Niezaufane lokalne pliki SWF nie mogą łączyć się z Internetem.";
"IDS_CONSOLE_LOCAL_INBOUND"					= "— Zdalne pliki SWF nie mogą uzyskać dostępu do plików lokalnych.";
"IDS_CONSOLE_WARN_AVM1_LOADED_AVM2"			= "Uwaga! Plik SWF ActionScript 1.0/2.0 wczytał plik SWF ActionScript 3.0. Kod w pliku SWF ActionScript 3.0 nie zostanie uruchomiony.";
"IDS_CONSOLE_WINDOW_HALTED"					= "Adres URL dla okna „%s” został zablokowany (właściwość AllowScriptAccess ma wartość „%s”): %s";
"IDS_CONSOLE_ALLOW_NETWORK"					= "— Jest to spowodowane wartością parametru „allowNetworking”.";
"IDS_CONSOLE_NO_POLICY_FILE"				= "Wczytanie pliku reguł z %s nie powiodło się.";
"IDS_CONSOLE_BAD_POLICY_FILE"				= "[ścisłe] Plik reguł w %s zostanie zignorowany ze względu na nieprawidłową składnię.  Pomoc w rozwiązaniu tego problemu można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_PREFIX_OK"						= "OK: ";
"IDS_CONSOLE_PREFIX_WARNING"				= "Uwaga!";
"IDS_CONSOLE_PREFIX_ERROR"					= "Błąd: ";
"IDS_CONSOLE_GOOD_POLICY_FILE"				= "Zaakceptowano plik reguł: %s";
"IDS_CONSOLE_BAD_POLICY_FILE_TYPE"			= "[ścisłe] Plik reguł w %s zostanie zignorowany ze względu na nieprawidłowy nagłówek Content-Type „%s”.  Pomoc w rozwiązaniu tego problemu można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_NO_POLICY_FILE_TYPE"			= "[ścisłe] Plik reguł w %s zostanie zignorowany ze względu na brakujący nagłówek Content-Type.  Pomoc w rozwiązaniu tego problemu można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_FILE_NO_HEADERS"		= "Nagłówki odpowiedzi HTTP są niedostępne na tej platformie.  Nie można wymusić ścisłych zasad plików reguł.";
"IDS_CONSOLE_POLICY_FILE_REDIRECT"			= "[ścisłe] Plik reguł wymagany z %s przekierowano do %s. Do określenia zakresu zostanie użyty końcowy adres URL.  Pomoc w rozwiązaniu ewentualnych problemów można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_FILE_CROSS_DOMAIN"		= "Plik reguł żądany z %s zostanie zignorowany z powodu wystąpienia przekierowania międzydomenowego do %s.";
"IDS_CONSOLE_TOP_URL"						= "Wczytano plik SWF pierwszego poziomu: %s";
"IDS_CONSOLE_META_POLICY_HDR_UNKNOWN"		= "Nierozpoznana metareguła w nagłówku HTTP z %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_FTP"			= "Nagłówek HTTP z %s określa metaregułę „by-ftp-filename”, która odnosi się tylko do protokołu FTP, a nie do HTTP.";
"IDS_CONSOLE_META_POLICY_HDR_CONFLICT"		= "Metareguła powoduje konflikt w nagłówku HTTP z %s: %s";
"IDS_CONSOLE_META_POLICY_HDR_PREV"			= "Metareguła %s w nagłówku HTTP z %s powoduje konflikt z wcześniej ustaloną metaregułą %s.";
"IDS_CONSOLE_POLICY_FILE_NONE_THIS_RSP"		= "Plik reguł w %s zostanie zignorowany ze względu reguły X-Permitted-Cross-Domain-Policies: metareguła „none-this-response”";
"IDS_CONSOLE_POLICY_FILE_SITE_NONMASTER"	= "Znacznik <site-control> w pliku reguł z %s zostanie zignorowany. Ten znacznik jest dozwolony tylko w głównych plikach reguł.";
"IDS_CONSOLE_META_POLICY_BAD_BY_TYPE"		= "Znacznik <site-control> w pliku reguł z %s zostanie zignorowany. Metareguła „by-content-type” dotyczy tylko witryn HTTP.";
"IDS_CONSOLE_META_POLICY_BAD_BY_FTP"		= "Znacznik <site-control> w pliku reguł z %s zostanie zignorowany. Metareguła „by-ftp-filename” dotyczy tylko witryn FTP.";
"IDS_CONSOLE_META_POLICY_BAD_THIS_RESPONSE"	= "Znacznik <site-control> w pliku reguł z %s zostanie zignorowany. Metareguła „none-this-response” jest dozwolona tylko w nagłówku odpowiedzi HTTP reguł X-Permitted-Cross-Domain-Policies.";
"IDS_CONSOLE_META_POLICY_FILE_UNKNOWN"		= "Nierozpoznana metareguła w pliku reguł z %s: %s";
"IDS_CONSOLE_META_POLICY_FILE_PREV"			= "Metareguła %s w pliku reguł z %s powoduje konflikt z wcześniej ustaloną metaregułą %s.";
"IDS_CONSOLE_META_POLICY_DEFAULT"			= "Domena %s nie określa metareguły.  Zostanie zastosowana domyślna metareguła „master-only”.  Ta konfiguracja jest niezalecana.  Pomoc w rozwiązaniu tego problemu można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_FILE_SOCK_NONE_NO"		= "Plik SWF z %s nie może nawiązywać połączenia z soketem we własnej domenie bez pliku reguł.  Pomoc w rozwiązaniu tego problemu można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_FILE_SOCK_TIMEOUT"		= "Przekroczono limit czasu w %s (po 3 sekundach) podczas oczekiwania na plik reguł soketu.  Ta sytuacja nie powinna powodować żadnych problemów. Wyjaśnienie można znaleźć na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_META_POLICY_IMPLICIT"			= "Domena %s nie określa wyraźnie metareguły, ale nagłówek Content-Type pliku reguł %s to „text/x-cross-domain-policy”.  Zostanie zastosowana metareguła „by-content-type”.";
"IDS_CONSOLE_META_POLICY_REJECT"			= "Plik reguł w %s zostanie zignorowany ze względu na metaregułę „%s”.";
"IDS_CONSOLE_POLICY_FILE_TOO_BIG"			= "Plik reguł soketu w %s zostanie zignorowany, ponieważ jego rozmiar jest za duży.  Rozmiar plików reguł soketu nie może przekraczać 20 kilobajtów.";
"IDS_CONSOLE_MASTER_SELF_INVALIDATED"		= "Plik reguł w %s unieważnia swoje dyrektywy <allow-access-from>, ustawiając wartość metareguły „none”.";
"IDS_CONSOLE_POLICY_FILE_BAD_PORT_SPEC"		= "Nieprawidłowe określenie numeru portu „%s” w pliku reguł w %s zostanie zignorowane.";
"IDS_CONSOLE_POLICY_FILE_BAD_ALLOW"			= "Nieprawidłowy znacznik <%s> dla domeny „%s” w pliku reguł w %s zostanie zignorowany.";
"IDS_CONSOLE_REQUEST_ALLOWED_BY_POLICY"		= "Żądanie zasobu w %s wysłane przez obiekt żądający z %s jest dozwolone ze względu na plik reguł w %s.";
"IDS_CONSOLE_REQUEST_DENIED_NO_POLICY"		= "Żądanie zasobu w %s wysłane przez obiekt żądający z %s zostało odrzucone ze względu na brak uprawnień do pliku reguł.";
"IDS_CONSOLE_SOCKET_UNAVAILABLE"			= "Żądanie zasobu w %s wysłane przez obiekt żądający z %s zakończyło się niepowodzeniem, ponieważ serwer jest nieosiągalny.";
"IDS_CONSOLE_NO_ASFUNCTION"					= "Adres URL %s zostanie odrzucony, ponieważ protokół „asfunction:” może być używany tylko dla obiektów docelowych łączy, a nie dla sieciowych interfejsów API.";
"IDS_CONSOLE_POLICY_BAD_SECURE_ATTR"		= "Atrybut „secure” w pliku reguł z %s zostanie zignorowany. Atrybut „secure” jest dozwolony tylko w protokole HTTPS i plikach reguł soketu.  Szczegółowe informacje są dostępne na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_SOCK_SECURE_ATTR"		= "Znaleziono wartość secure=\'true\' (prawda) w pliku reguł z %s, ale host %s nie odnosi się do komputera lokalnego.  Taka sytuacja może być niebezpieczna.  Szczegółowe informacje są dostępne na stronie http://www.adobe.com/go/strict_policy_files_pl.";
"IDS_CONSOLE_POLICY_REASON_DATA"			= "Szukanie znacznika <allow-access-from> w plikach reguł w celu autoryzowania przez obiekt żądający z %s ładowania danych z zasobu w %s.";
"IDS_CONSOLE_POLICY_REASON_HEADERS"			= "Szukanie znacznika <allow-http-request-headers-from> w plikach reguł w celu autoryzowania przez obiekt żądający z %s wysyłania nagłówka do adresu URL %s.";
"IDS_CONSOLE_QUESTIONABLE_SCRIPTING"		= "— Adresy URL ze skryptami przeglądarki można wykonywać tylko za pomocą funkcji getURL i navigateToURL.";
"IDS_CONSOLE_WARN_ALLOW_NEVER"				= "Ostrzeżenie: W pliku HTML znaleziono parametr AllowScriptAccess=\'never\'.  To ustawienie nie jest już używane i nie działa.  Szczegółowe informacje są dostępne na stronie http://www.adobe.com/go/allowscriptaccess_pl.";
"IDS_CONSOLE_WARN_ALLOW_SAMEDOM"			= "Ostrzeżenie: W pliku HTML (w tej samej domenie co plik SWF) znaleziono parametr AllowNetworking=\'%s\'. To ustawienie nie jest już używane i nie działa. Szczegółowe informacje są dostępne na stronie http://www.adobe.com/go/allowscriptaccess_pl.";
"IDS_CONSOLE_WARN_3D_SURFACE_TOO_BIG"		= "Ostrzeżenie: Obiekt DisplayObject 3D nie zostanie wyrenderowany.  Wymiary (%s, %s) są za duże i uniemożliwiają jego narysowanie.";
"IDS_CONSOLE_WARN_FILTER_TOO_BIG"			= "Ostrzeżenie: Filtr nie zostanie wyrenderowany.  Wymiary obiektu DisplayObject po zastosowaniu filtru (%s, %s) są za duże i uniemożliwiają jego narysowanie.";
"IDS_CONSOLE_FORCE_DOWNLOAD_WAS_SET"		= "Próba załadowania elementu %s nie powiodła się, ponieważ miał on ustawiony parametr Content-Disposition zestawu attachment.";
"IDS_CONSOLE_USER_ACTION_REQUIRED"			= "Niektóre operacje (np. te, które powodują pojawienie się wyskakującego okna) mogą być wykonane tylko w wyniku działania użytkownika, na przykład po kliknięciu myszą lub naciśnięciu przycisku.";
"IDS_LOCALCONNECTION_USERSCOPED_LOCKED"     = "Nie można zmienić wartości pola LocalConnection.isPerUser, ponieważ została już zablokowana przez wywołanie metody LocalConnection.connect, .send lub .close.";
"IDS_CONSOLE_POLICY_FILE_BAD_PF_URL"		= "Ignorowanie pliku reguł z nieprawidłowym adresem URL zawierającym znaki spoza zestawu ASCII %s";
"IDS_CONSOLE_POLICY_FILE_BAD_DATA_URL"		= "Nie można autoryzować operacji w przypadku nieprawidłowego adresu URL zawierającego znaki spoza zestawu ASCII %s";
